In [7]:
stu_details = {'sid':[1,2,3,4,5],'s_name':['A','B','C','D','E'],'s_region':['N','S','E','W']}
stu_marks = {'sid':[1,2,3,4,5],'ssub':['Py','R','Tab','Py','Py'],'ssmarks':[21,21,11,21,43]}

In [8]:
 stu_details

{'sid': [1, 2, 3, 4, 5],
 's_name': ['A', 'B', 'C', 'D', 'E'],
 's_region': ['N', 'S', 'E', 'W']}

In [9]:
stu_marks

{'sid': [1, 2, 3, 4, 5],
 'ssub': ['Py', 'R', 'Tab', 'Py', 'Py'],
 'ssmarks': [21, 21, 11, 21, 43]}

In [ ]:
import pandas as pd
df1=pd.DataFrame(stu_marks)

In [ ]:
import pandas as pd
df1 = pd.DataFrame(stu_marks)

In [ ]:
stu_details = {'sid':[1,2,3,4,5],'s_name':['A','B','C','D','E'],'s_region':['N','S','S','E','W']}
stu_marks = {'sid':[1,2,3,4,5],'ssub':['Py','R','Tab','Py','Py'],'ssmarks':[21,21,11,21,43]}

In [50]:
stu_details

{'sid': [1, 2, 3, 4, 5],
 's_name': ['A', 'B', 'C', 'D', 'E'],
 's_region': ['N', 'S', 'E', 'W']}

In [22]:
stu_marks

{'sid': [1, 2, 3, 4, 5],
 'ssub': ['Py', 'R', 'Tab', 'Py', 'Py'],
 'ssmarks': [21, 21, 11, 21, 43]}

In [ ]:
import pandas as pd
df3 = pd.DataFrame(stu_details)

In [35]:
df1=pd.DataFrame(stu_marks)
df1

   sid ssub  ssmarks
0    1   Py       21
1    2    R       21
2    3  Tab       11
3    4   Py       21
4    5   Py       43

In [36]:
df1=pd.DataFrame(stu_marks)df1

   sid ssub  ssmarks
0    1   Py       21
1    2    R       21
2    3  Tab       11
3    4   Py       21
4    5   Py       43

In [37]:
df1

   sid ssub  ssmarks
0    1   Py       21
1    2    R       21
2    3  Tab       11
3    4   Py       21
4    5   Py       43

In [43]:
df1=pd.DataFrame(stu_marks)

   sid ssub  ssmarks
0    1   Py       21
1    2    R       21
2    3  Tab       11
3    4   Py       21
4    5   Py       43

In [9]:
stu_details

{'sid': [1, 2, 3, 4, 5],
 's_name': ['A', 'B', 'C', 'D', 'E'],
 's_region': ['N', 'S', 'S', 'E', 'W']}

In [5]:
stu_details = {'sid':[1,2,3,4,5],'s_name':['A','B','C','D','E'],'s_region':['N','S','S','E','W']}

In [6]:
stu_details

{'sid': [1, 2, 3, 4, 5],
 's_name': ['A', 'B', 'C', 'D', 'E'],
 's_region': ['N', 'S', 'S', 'E', 'W']}

In [36]:
stu_details = {'sid':[1,2,3,4,5],'s_name':['A','B','C','D','E'],'s_region':['N','S','S','E','W']}
stu_marks = {'sid':[1,2,3,4,6],'ssub':['Py','R','Tab','Py','Py'],'ssmarks':[21,21,11,21,43]}

In [37]:
stu_details

{'sid': [1, 2, 3, 4, 5],
 's_name': ['A', 'B', 'C', 'D', 'E'],
 's_region': ['N', 'S', 'S', 'E', 'W']}

In [38]:
stu_marks

{'sid': [1, 2, 3, 4, 6],
 'ssub': ['Py', 'R', 'Tab', 'Py', 'Py'],
 'ssmarks': [21, 21, 11, 21, 43]}

In [39]:
import pandas as pd
df1=pd.DataFrame(stu_details)

In [40]:
df1

   sid s_name s_region
0    1      A        N
1    2      B        S
2    3      C        S
3    4      D        E
4    5      E        W

In [41]:
df2=pd.DataFrame(stu_marks)

In [42]:
df2

   sid ssub  ssmarks
0    1   Py       21
1    2    R       21
2    3  Tab       11
3    4   Py       21
4    6   Py       43

In [43]:
pd.merge(df1,df2,left_on='sid',right_on='sid',how="inner")

   sid s_name s_region ssub  ssmarks
0    1      A        N   Py       21
1    2      B        S    R       21
2    3      C        S  Tab       11
3    4      D        E   Py       21

In [44]:
pd.merge(df1,df2,left_on='sid',right_on='sid',how='left')

   sid s_name s_region ssub  ssmarks
0    1      A        N   Py     21.0
1    2      B        S    R     21.0
2    3      C        S  Tab     11.0
3    4      D        E   Py     21.0
4    5      E        W  NaN      NaN

In [45]:
pd.merge(df1,df2,left_on='sid',right_on='sid',how='left')

   sid s_name s_region ssub  ssmarks
0    1      A        N   Py     21.0
1    2      B        S    R     21.0
2    3      C        S  Tab     11.0
3    4      D        E   Py     21.0
4    5      E        W  NaN      NaN

In [46]:
pd.merge(df1,df2,left_on='sid',right_on='sid',how='right')

   sid s_name s_region ssub  ssmarks
0    1      A        N   Py       21
1    2      B        S    R       21
2    3      C        S  Tab       11
3    4      D        E   Py       21
4    6    NaN      NaN   Py       43

In [47]:
pd.merge(df1,df2,left_on='sid',right_on='sid',how='outer')

   sid s_name s_region ssub  ssmarks
0    1      A        N   Py     21.0
1    2      B        S    R     21.0
2    3      C        S  Tab     11.0
3    4      D        E   Py     21.0
4    5      E        W  NaN      NaN
5    6    NaN      NaN   Py     43.0

In [55]:
pd.concat([df1,df2]).reset_index().drop_duplicates().drop(columns='index')

   sid s_name s_region ssub  ssmarks
0    1      A        N  NaN      NaN
1    2      B        S  NaN      NaN
2    3      C        S  NaN      NaN
3    4      D        E  NaN      NaN
4    5      E        W  NaN      NaN
5    1    NaN      NaN   Py     21.0
6    2    NaN      NaN    R     21.0
7    3    NaN      NaN  Tab     11.0
8    4    NaN      NaN   Py     21.0
9    6    NaN      NaN   Py     43.0

In [63]:
output=pd.concat([df1,df2]).reset_index().drop_duplicates().drop(columns='index')

In [68]:
output.to_excel('todays.xlsx')

In [67]:
output.to_excel('todays.xlsx')

In [69]:
import os
os.getcwd()

'C:\\Users\\DELL\\Desktop'

In [70]:
os.chdir('C:\\Users\\DELL\\Desktop')